{
  "Dockerfile.vim": { "branch": "master" },
  "Jenkinsfile-vim-syntax": { "branch": "master" },
  "alloy.vim": { "branch": "master" },
  "applescript.vim": { "branch": "master" },
  "catppuccin": { "branch": "main" },
  "csv.vim": { "branch": "master" },
  "dart-vim-plugin": { "branch": "master" },
  "ebnf.vim": { "branch": "master" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "gleam.vim": { "branch": "main" },
  "goyo.vim": { "branch": "master" },
  "idris-vim": { "branch": "master" },
  "lalrpop.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lightline.vim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "n3.vim": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "pollen.vim": { "branch": "master" },
  "rust.vim": { "branch": "master" },
  "rustaceanvim": { "branch": "master" },
  "setcolors.vim": { "branch": "master" },
  "swift.vim": { "branch": "master" },
  "tla.vim": { "branch": "master" },
  "typescript-vim": { "branch": "master" },
  "vim-astro": { "branch": "main" },
  "vim-coffee-script": { "branch": "master" },
  "vim-colorschemes": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-elixir": { "branch": "master" },
  "vim-flutter": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gitgutter": { "branch": "main" },
  "vim-glsl": { "branch": "master" },
  "vim-graphql": { "branch": "master" },
  "vim-javascript": { "branch": "master" },
  "vim-jsx": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-nix": { "branch": "master" },
  "vim-racket": { "branch": "master" },
  "vim-rescript": { "branch": "master" },
  "vim-scala": { "branch": "master" },
  "vim-sparql": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-terraform": { "branch": "master" },
  "vim-toml": { "branch": "main" },
  "vim-wasm": { "branch": "master" },
  "vimtex": { "branch": "master" }
}
