tap "leostera/macos-cross-toolchains"
tap "oven-sh/bun"
tap "rossmacarthur/tap"
# Automatic configure script builder
brew "autoconf"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Tool for building toolchains
brew "crosstool-ng"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# AI coding agent, built for the terminal
brew "opencode"
# Shell command parallelization utility
brew "parallel"
# Parse HTML at the command-line
brew "pup"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# UNIX shell (command interpreter)
brew "zsh"
# aarch64-unknown-linux-gnu Toolchain
brew "leostera/macos-cross-toolchains/aarch64-unknown-linux-gnu"
# aarch64-unknown-linux-musl Toolchain
brew "leostera/macos-cross-toolchains/aarch64-unknown-linux-musl"
# x86_64-unknown-linux-gnu Toolchain
brew "leostera/macos-cross-toolchains/x86_64-unknown-linux-gnu"
# x86_64-unknown-linux-musl Toolchain
brew "leostera/macos-cross-toolchains/x86_64-unknown-linux-musl"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Command-line tool to remap macOS keyboard keys
brew "rossmacarthur/tap/kb-remap"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Chromium based browser
cask "arc"
# Voice and text chat software
cask "discord"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# App to manage software development and track bugs
cask "linear-linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Native desktop client for WhatsApp
cask "whatsapp"
