brew "bat"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zsh"
