tap "messense/macos-cross-toolchains"
tap "rossmacarthur/tap"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# AI coding agent, built for the terminal
brew "opencode"
# Shell command parallelization utility
brew "parallel"
# Parse HTML at the command-line
brew "pup"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# aarch64-unknown-linux-gnu Toolchain
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
# aarch64-unknown-linux-musl Toolchain
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-musl"
# x86_64-unknown-linux-gnu Toolchain
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
# x86_64-unknown-linux-musl Toolchain
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-musl"
# Command-line tool to remap macOS keyboard keys
brew "rossmacarthur/tap/kb-remap"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Voice and text chat software
cask "discord"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# App to manage software development and track bugs
cask "linear-linear"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source software for live streaming and screen recording
cask "obs"
# Replacement for Docker Desktop
cask "orbstack"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Native desktop client for WhatsApp
cask "whatsapp"
