tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "tldr-pages/tldr"
tap "twilio/brew"
tap "universal-ctags/universal-ctags"
brew "gettext"
brew "sqlite"
brew "python@3.9"
brew "glib"
brew "cloc"
brew "coreutils"
brew "docker"
brew "docutils"
brew "erlang"
brew "elixir"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "gist"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "htop"
brew "jq"
brew "libsass"
brew "mkcert"
brew "netcat"
brew "opam"
brew "postgresql"
brew "ripgrep"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "twilio/brew/twilio"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "google-chrome"
cask "pusher"
cask "visual-studio-code"
cask "vlc"
